# WallAttrDefheightParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallAttrDefheightParam Property
ParameterTypeId Class See Also
---
"Default height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallAttrDefheightParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallAttrDefheightParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallAttrDefheightParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace